The workset id.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public WorksetId WorksetId { get; }
  Visual Basic
Public ReadOnly Property WorksetId As WorksetId
	Get
  Visual C++
public:
property WorksetId^ WorksetId {
	WorksetId^ get ();
}
 See Also
  ElementWorksetFilter Class
  Autodesk.Revit.DB Namespace